In [1]:
%load_ext sql
%sql duckdb://

# Creating Permanent Tables

This code snippet demonstrates the process of creating a permanent table in SQL. Here are the steps performed:

1. Create a new database using the `CREATE DATABASE` statement.
2. Switch to the newly created database using the `USE` statement.
3. Create a new table named "employees" with columns "id", "name", "age", and "salary" using the `CREATE TABLE` statement.
4. Insert data into the table using the `INSERT INTO` statement.
5. Retrieve all data from the table using the `SELECT * FROM` statement.
6. Update the salary of an employee using the `UPDATE` statement.
7. Delete a row from the table using the `DELETE FROM` statement.
8. Retrieve specific data from the table using the `SELECT` statement with a `WHERE` clause.
9. Drop the table using the `DROP TABLE` statement.
10. Drop the database using the `DROP DATABASE` statement.

The code is well-commented to explain each step and the expected output is mentioned after each print statement.

## Creating Database

Doesn't work here, but good to know.  You can create a new DB and switch to it so that future operations will go there.

In [2]:
%%sql

CREATE DATABASE mydatabase;
USE mydatabase;

Running query in 'duckdb://'

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(duckdb.ParserException) Parser Error: syntax error at or near "DATABASE"
LINE 1: CREATE DATABASE mydatabase;
               ^
[SQL: CREATE DATABASE mydatabase;]
(Background on this error at: https://sqlalche.me/e/20/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

## Creating a Table

In [7]:
%%sql

CREATE OR REPLACE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2)
);

-- Insert data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000.00),
       (2, 'Jane Smith', 35, 60000.00),
       (3, 'Mike Johnson', 25, 45000.00);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

## Modify the Table

In [4]:
%%sql

UPDATE employees
SET salary = 55000.00
WHERE id = 1;

DELETE FROM employees
WHERE id = 3;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

## Delete the Table

In [5]:
%%sql
DROP TABLE employees;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

## Delete the Database

In [6]:
%%sql
DROP DATABASE mydatabase;

Running query in 'duckdb://'

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(duckdb.ParserException) Parser Error: syntax error at or near "DATABASE"
LINE 1: DROP DATABASE mydatabase;
             ^
[SQL: DROP DATABASE mydatabase;]
(Background on this error at: https://sqlalche.me/e/20/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

# Creating Temporary Tables

In SQL, temporary tables are used to store data temporarily within a session. They are useful for storing intermediate results or performing complex calculations. Temporary tables are only accessible within the session that created them and are automatically dropped when the session ends or when explicitly dropped using the `DROP TEMPORARY TABLE` statement. Temporary tables can be created with specific columns and data types or can be created based on the structure of an existing table. Data can be inserted into temporary tables using the `INSERT INTO` statement, and the data can be queried using the `SELECT` statement.

In [8]:
%%sql

CREATE TEMPORARY TABLE temp_table (
    id INT,
    name VARCHAR(50)
);

-- Insert data into the temporary table
INSERT INTO temp_table (id, name) VALUES (1, 'John'), (2, 'Jane'), (3, 'Alice');

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [13]:
%%sql

CREATE TEMPORARY TABLE temp_table2 AS
SELECT * FROM temp_table;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [15]:
%%sql

DROP TABLE temp_table;
DROP TABLE temp_table2;

Running query in 'duckdb://'

+---------+
| Success |
+---------+
+---------+

# Cloning Tables

Cloning tables can be useful when you want to create a backup or make a copy of an existing table for further analysis or modifications without affecting the original table.

In [16]:
%%sql

CREATE OR REPLACE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 35, 60000),
       (3, 'Mike Johnson', 40, 70000);

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [18]:
%%sql

CREATE OR REPLACE TABLE employees_clone AS
    SELECT * FROM employees;

Running query in 'duckdb://'

+-------+
| Count |
+-------+
+-------+

In [19]:
%%sql

SELECT * FROM employees_clone;

Running query in 'duckdb://'

+----+--------------+-----+----------+
| id |     name     | age |  salary  |
+----+--------------+-----+----------+
| 1  |   John Doe   |  30 | 50000.00 |
| 2  |  Jane Smith  |  35 | 60000.00 |
| 3  | Mike Johnson |  40 | 70000.00 |
+----+--------------+-----+----------+